system/meshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                |
| \\      /  F ield         | cfMesh: A library for mesh generation          | 
|  \\    /   O peration     |                                                |
|   \\  /    A nd           | Author: Franjo Juretic                         | 
|    \\/     M anipulation  | E-mail: franjo.juretic@c-fields.com            |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version   2.0;
    format    ascii;
    class     dictionary;
    location  "system";
    object    meshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceFile "cavity.fms";

maxCellSize 0.1;

boundaryCellSize 0.05;

minCellSize 0.01;

localRefinement
{
    "inlet"
    {
        cellSize 0.02;
    }
    "outlet"
    {
        cellSize 0.02;
    }  
}

/*boundaryLayers
{
    nLayers 5;

    thicknessRatio 1.1;

    maxFirstLayerThickness 0.5;

//    patchBoundaryLayers
//    {
//    }
}*/
               
     
// ************************************************************************* //
