0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    backSide
    {
        type            noSlip;
    }
    bottomLeftSide
    {
        type            noSlip;
    }
    bottomRightSide
    {
        type            noSlip;
    }
    frontSide
    {
        type            noSlip;
    }
    hole
    {
        type            noSlip;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 100);
    }
    leftSide
    {
        type            noSlip;
    }
    outlet
    {
        type            zeroGradient;
    }
    rightSide
    {
        type            noSlip;
    }
    topSide
    {
        type            noSlip;
    }
}

// ************************************************************************* //
